src/InformationRegisters/СвязиМеждуПартнерами/СвязиМеждуПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиМеждуПартнерами</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПервыйПартнер</name>
    <comment>Первый партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВторойПартнер</name>
    <comment>Второй партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвязи</name>
    <type>
      <types>CatalogRef.ВидыСвязейМеждуПартнерами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СвязиМеждуПартнерами/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);

	Если НЕ ЗначениеЗаполнено(Запись.Автор)
	 ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Параметры.Свойство("Партнер") Тогда
		Запись.ПервыйПартнер = Параметры.Партнер;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаголовокРеквизитаВЗависимостиОтФОИспользоватьПартнеровКакКонтрагентов(
	               ЭтотОбъект, "Партнер1", НСтр("ru='Первый контрагент';uk='Перший контрагент'"));
	ПартнерыИКонтрагенты.ЗаголовокРеквизитаВЗависимостиОтФОИспользоватьПартнеровКакКонтрагентов(
	               ЭтотОбъект, "Партнер2", НСтр("ru='Второй контрагент';uk='Другий контрагент'"));
	ПартнерыИКонтрагенты.ЗаголовокРеквизитаВЗависимостиОтФОИспользоватьПартнеровКакКонтрагентов(
	               ЭтотОбъект, "", НСтр("ru='Связь между контрагентами';uk='Зв''язок між контрагентами'"));
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	Если Запись.ПервыйПартнер = Запись.ВторойПартнер Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
			ТекстСообщения = НСтр("ru='Контрагенты, указанные в связи не должны совпадать.';uk='Контрагенти, зазначені у зв''язку не повинні збігатися.'");
		Иначе
			ТекстСообщения = НСтр("ru='Партнеры, указанные в связи не должны совпадать.';uk='Партнери, зазначені у зв''язку не повинні збігатися.'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		,
		"ПервыйПартнер",, Отказ);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
